ednieuw/RTCcheck/ESP32_RTCcheckV019/ESP32_RTCcheckV019.ino
  Serial.print("TCA9548A search on addres 0x");                                               // Test or TCA9548A is available
  Serial.print(TCA_ADDR, HEX);
  Serial.print("... ");
  
  Wire.beginTransmission(TCA_ADDR);
  if (Wire.endTransmission() == 0) {
    Serial.println("FOUND!");
  } else 
  {
    Serial.println("NOT FOUND!\ncheck wiring and power");
    while(1);                                                                                // 
  }  
  Serial.println("\nScanning DS3231 modules...");                                            // Scan which channels a DS3231 has
  for (int i = 0; i < MAX_RTC; i++) 
   {
    selectTCAChannel(i);
    delay(50); 
    Wire.beginTransmission(0x68);                                                            // DS3231 address
    uint8_t error = Wire.endTransmission();
    
    if (error == 0) {Serial.print("DS3231 found on channel "); Serial.println(i);  } 
    else {sprintf(sptext,"No DS3231 on channel %d Error : %d", i,error); Tekstprintln(sptext); }
  }
  Serial.println("\nInitialising RTC modules...");                                            // Initialiseonly found RTC modules
  for (int i = 0; i < MAX_RTC; i++) 
   {
    selectTCAChannel(i);                                                                      // Select multiplexer channel
    delay(50);
    
    Serial.print("Initialising RTC ");
    Serial.print(i);
    Serial.print("... ");
    
    // Test eerst of er een device is
    Wire.beginTransmission(0x68);
    if (Wire.endTransmission() != 0) 
    {
      Serial.println("NO DEVICE");
      continue;
    }
    
    if (!rtc[i].begin()) 
     {
      Serial.println("FAILED!");
      Serial.println("Check connection on channel " + String(i));
      rtcActive[i] = false;
     } 
    else 
     {
      Serial.println("OK!");
      rtcActive[i] = true;
      activeRTCCount++;
      DateTime newTime = rtc[i].now();                                                        // Check time set
      sprintf(sptext,"RTC%d current time: %02d/%02d/%04d %02d:%02d:%02d ",i, newTime.day(),newTime.month(),newTime.year(),
                                                                      newTime.hour(),newTime.minute(),newTime.second());
      Tekstprintln(sptext);  
     }
    delay(100); 
   }
  sprintf(sptext,"Setup finished! %d  RTC modules active.", activeRTCCount);
  Tekstprintln(sptext); 
}

//--------------------------------------------                                                //
// RTC8 Print RTC times
//-------------------------------------------- 
void PrintRTCtimes(void)
{
  for (int i = 0; i < MAX_RTC; i++)                                                           // Read time of all ACTIVE RTC modules
  {
    if (!rtcActive[i]) continue;                                                              // Skip non-active RTC's
    selectTCAChannel(i);                                                                      // Select the RTC channel on the TCA9548A I2C multiplexer
    delay(10);
    char ff[16];
    dtostrf(rtc[i].getTemperature(), 0, 2, ff);                                               // Get the RTC temperature
    DateTime now = rtc[i].now();
    sprintf(sptext,"RTC %d: %02d/%02d/%04d %02d:%02d:%02d T: %s C",
             i, now.day(),now.month(),now.year(), now.hour(),now.minute(),now.second(), ff);
    Tekstprintln(sptext);    
  }
}
//--------------------------------------------                                                //
// RTC8 Print RTC differences from NTP
//--------------------------------------------
void PrintDifRTCtimes(void)
{
 
 Tekstprint("");
 CalcDifRTCtimes();
 for (int i = 0; i < MAX_RTC; i++) 
  {  
   if (!rtcActive[i]) { continue; } 
   sprintf(sptext,"|T%d:%2ld",i,RTCdiffSec[i]);
   Tekstprint(sptext);
  }
 Tekstprint("| ");
}
//--------------------------------------------                                                //
// RTC8 Update the time difference in the LEDs
// 1 second sec * -10 GREEN sec * 10 RED
// BLUE is empty
// max time difference = 25 seconds. 26 = NA
//--------------------------------------------
void UpdateRTCTimeLEDs(void)
{
 CalcDifRTCtimes();                                                                          // Calculate difference in sec from NTP
 for (int i = 0; i < MAX_RTC; i++)                                                           // Read time of all ACTIVE RTC modules
  {
   int c;
   if (!rtcActive[i]) c = -1;                                                                // Skip non-active RTC's 
   else c = RTCdiffSec[i]; 
   switch (c)
    {
      case  0 ...  1: ColorLed(i,green);      break;
      case  2 ...  4: ColorLed(i,orange);     break;
      case  5 ...  7: ColorLed(i,greenblue);  break;
      case  8 ... 10: ColorLed(i,darkviolet); break;
      case 11 ... 17: ColorLed(i,pink);       break;
      case 18 ... 25: ColorLed(i,purple);     break;
      case 26 ...999: ColorLed(i,red);        break;
      default:        ColorLed(i,blue); 
    }
    // {
    //   case  0 ...  1: ColorLed(i,green);     Tekstprint("|green ");      break;
    //   case  2 ...  4: ColorLed(i,orange);    Tekstprint("|orange ");     break;
    //   case  5 ...  7: ColorLed(i,greenblue); Tekstprint("|greenblue ");  break;
    //   case  8 ... 10: ColorLed(i,darkviolet);Tekstprint("|darkviolet "); break;
    //   case 11 ... 17: ColorLed(i,pink);      Tekstprint("|pink ");       break;
    //   case 18 ... 25: ColorLed(i,purple);    Tekstprint("|purple ");     break;
    //   case 26 ...999: ColorLed(i,red);       Tekstprint("|red ");        break;
    //   default:        ColorLed(i,blue);      Tekstprint("|blue ");
    // }
  }
Tekstprintln("");  
ShowLeds(); 
}

//--------------------------------------------                                                //
// RTC8 Calculate difference in sec from NTP
//-------------------------------------------- 
static time_t To_time_t(const DateTime& dt)
{
 struct tm rtc_tm = {};
 rtc_tm.tm_year  = dt.year()  - 1900;
 rtc_tm.tm_mon   = dt.month() - 1;
 rtc_tm.tm_mday  = dt.day();
 rtc_tm.tm_hour  = dt.hour();
 rtc_tm.tm_min   = dt.minute();
 rtc_tm.tm_sec   = dt.second();
 rtc_tm.tm_isdst = -1;
 return mktime(&rtc_tm);
}

